Revit 2026 API

# RadioButtonGroupAddItem Method

---

Adds a new ToggleButton to the RadioButtonGroup.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ToggleButton AddItem(
	ToggleButtonData buttonData
)
```
```vb
Public Function AddItem (
	buttonData As ToggleButtonData
) As ToggleButton
```
```cpp
public:
ToggleButton^ AddItem(
	ToggleButtonData^ buttonData
)
```
```fsharp
member AddItem :
        buttonData : ToggleButtonData -> ToggleButton
```

#### Parameters

buttonData ToggleButtonData
    An object containing the data needed to construct the ToggleButton.

#### Return Value

ToggleButton The newly added ToggleButton.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when buttonData is . |
| ArgumentException | Thrown when button with buttonData.Name already exists in the group. |

#### Reference

RadioButtonGroup Class

Autodesk.Revit.UI Namespace